; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v1 - type_3 ?v6 - type_1)
 	      (pred_1 ?v8 - object ?v6 - type_1)
	      (pred_2 ?v1 - type_3 ?v2 - type_2)
	      (pred_3 ?v1 - type_3 ?v8 - object ?v2 - type_2))

   (:action op_1
       :parameters  (?v1 - type_3 ?v7 ?v4 - type_1)
       :precondition (and  (pred_4 ?v1 ?v7))
       :effect (and  (pred_4 ?v1 ?v4)
		     (not (pred_4 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_3 ?v3 - object ?v5 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v5) (pred_4 ?v1 ?v5) (pred_2 ?v1 ?v2))
       :effect (and (pred_3 ?v1 ?v3 ?v2)
		    (not (pred_1 ?v3 ?v5)) 
		    (not (pred_2 ?v1 ?v2))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v5 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v3 ?v2) (pred_4 ?v1 ?v5))
       :effect (and (pred_1 ?v3 ?v5)
		    (pred_2 ?v1 ?v2)
		    (not (pred_3 ?v1 ?v3 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_3
obj_06 obj_08 - type_2
obj_10 obj_01 obj_04 obj_03 - type_1
obj_07 obj_05 obj_02 - object)
(:init
(pred_4 obj_09 obj_04)
(pred_2 obj_09 obj_06)
(pred_2 obj_09 obj_08)
(pred_1 obj_07 obj_04)
(pred_1 obj_05 obj_10)
(pred_1 obj_02 obj_01)
)
(:goal
(and
(pred_1 obj_07 obj_10)
(pred_1 obj_05 obj_04)
(pred_1 obj_02 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_09 ?b obj_08))))
)
)

; plan
1. (op_2 obj_09 obj_07 obj_04 obj_06)
   deleted: (pred_1 obj_07 obj_04) (pred_2 obj_09 obj_06)
   added: (pred_3 obj_09 obj_07 obj_06)
   goals met: 0 of 3
2. (op_1 obj_09 obj_04 obj_10)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_10)
   goals met: 0 of 3
3. (op_3 obj_09 obj_07 obj_10 obj_06)
   deleted: (pred_3 obj_09 obj_07 obj_06)
   added: (pred_1 obj_07 obj_10) (pred_2 obj_09 obj_06)
   goals met: 1 of 3
4. (op_2 obj_09 obj_05 obj_10 obj_06)
   deleted: (pred_1 obj_05 obj_10) (pred_2 obj_09 obj_06)
   added: (pred_3 obj_09 obj_05 obj_06)
   goals met: 1 of 3
5. (op_1 obj_09 obj_10 obj_04)
   deleted: (pred_4 obj_09 obj_10)
   added: (pred_4 obj_09 obj_04)
   goals met: 1 of 3
6. (op_3 obj_09 obj_05 obj_04 obj_06)
   deleted: (pred_3 obj_09 obj_05 obj_06)
   added: (pred_1 obj_05 obj_04) (pred_2 obj_09 obj_06)
   goals met: 2 of 3
7. (op_1 obj_09 obj_04 obj_01)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_01)
   goals met: 2 of 3
8. (op_2 obj_09 obj_02 obj_01 obj_06)
   deleted: (pred_1 obj_02 obj_01) (pred_2 obj_09 obj_06)
   added: (pred_3 obj_09 obj_02 obj_06)
   goals met: 2 of 3
9. (op_1 obj_09 obj_01 obj_04)
   deleted: (pred_4 obj_09 obj_01)
   added: (pred_4 obj_09 obj_04)
   goals met: 2 of 3
10. (op_3 obj_09 obj_02 obj_04 obj_06)
   deleted: (pred_3 obj_09 obj_02 obj_06)
   added: (pred_1 obj_02 obj_04) (pred_2 obj_09 obj_06)
   goals met: 3 of 3
